emsesp/EMS-ESP32/src/analogsensor.cpp
                config["obj_id"]  = uniq_s;
                config["uniq_id"] = uniq_s; // same as object_id

                char name[50];
                snprintf(name, sizeof(name), "%s", sensor.name().c_str());
                config["name"] = name;

                if (sensor.uom() != DeviceValueUOM::NONE) {
                    config["unit_of_meas"] = EMSdevice::uom_to_string(sensor.uom());
                }

                char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];

                // Set commands for some analog types
                char command_topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
#if CONFIG_IDF_TARGET_ESP32
                if (sensor.type() == AnalogType::DIGITAL_OUT && sensor.gpio() != 25 && sensor.gpio() != 26) {
#else
                if (sensor.type() == AnalogType::DIGITAL_OUT) {
#endif
                    snprintf(topic, sizeof(topic), "switch/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"] = command_topic;
                    if (EMSESP::system_.bool_format() == BOOL_FORMAT_TRUEFALSE) {
                        config["pl_on"]  = true;
                        config["pl_off"] = false;
                    } else if (EMSESP::system_.bool_format() == BOOL_FORMAT_10) {
                        config["pl_on"]  = 1;
                        config["pl_off"] = 0;
                    } else {
                        char result[12];
                        config["pl_on"]  = Helpers::render_boolean(result, true);
                        config["pl_off"] = Helpers::render_boolean(result, false);
                    }
                } else if (sensor.type() == AnalogType::DIGITAL_OUT) { // DAC
                    snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"] = command_topic;
                    config["min"]   = 0;
                    config["max"]   = 255;
                    config["mode"]  = "box"; // auto, slider or box
                    config["step"]  = 1;
                } else if (sensor.type() >= AnalogType::PWM_0 && sensor.type() <= AnalogType::PWM_2) {
                    snprintf(topic, sizeof(topic), "number/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"] = command_topic;
                    config["min"]   = 0;
                    config["max"]   = 100;
                    config["mode"]  = "box"; // auto, slider or box
                    config["step"]  = 0.1;
                } else if (sensor.type() == AnalogType::COUNTER) {
                    snprintf(topic, sizeof(topic), "sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    snprintf(command_topic, sizeof(command_topic), "%s/%s/%s", Mqtt::base().c_str(), F_(analogsensor), sensor.name().c_str());
                    config["cmd_t"]    = command_topic;
                    config["stat_cla"] = "total_increasing";
                    // config["mode"]  = "box"; // auto, slider or box
                    // config["step"]  = sensor.factor();
                } else if (sensor.type() == AnalogType::DIGITAL_IN) {
                    snprintf(topic, sizeof(topic), "binary_sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    if (EMSESP::system_.bool_format() == BOOL_FORMAT_TRUEFALSE) {
                        config["pl_on"]  = true;
                        config["pl_off"] = false;
                    } else if (EMSESP::system_.bool_format() == BOOL_FORMAT_10) {
                        config["pl_on"]  = 1;
                        config["pl_off"] = 0;
                    } else {
                        char result[12];
                        config["pl_on"]  = Helpers::render_boolean(result, true);
                        config["pl_off"] = Helpers::render_boolean(result, false);
                    }
                } else {
                    snprintf(topic, sizeof(topic), "sensor/%s/%s_%02d/config", Mqtt::basename().c_str(), F_(analogsensor), sensor.gpio());
                    config["stat_cla"] = "measurement";
                }

                // see if we need to create the [devs] discovery section, as this needs only to be done once for all sensors
                bool is_ha_device_created = false;
                for (auto & sensor : sensors_) {
                    if (sensor.ha_registered) {
                        is_ha_device_created = true;
                        break;
                    }
                }

                Mqtt::add_ha_sections_to_doc("analog", stat_t, config, !is_ha_device_created, val_cond);

                sensor.ha_registered = Mqtt::queue_ha(topic, config.as<JsonObject>());
            }
        }
    }

    char topic[Mqtt::MQTT_TOPIC_MAX_SIZE];
    snprintf(topic, sizeof(topic), "%s_data", F_(analogsensor));
    Mqtt::queue_publish(topic, doc.as<JsonObject>());
}

// called from emsesp.cpp for commands
// searches sensor by name
bool AnalogSensor::get_value_info(JsonObject output, const char * cmd, const int8_t id) {
    // check of it a 'commmands' command
    if (Helpers::toLower(cmd) == F_(commands)) {
        return Command::list(EMSdevice::DeviceType::ANALOGSENSOR, output);
    }

    if (sensors_.empty()) {
        return true; // no sensors, return true
    }

    uint8_t show_all = 0;
    if (Helpers::hasValue(cmd)) {
        show_all = (strncmp(cmd, F_(info), 4) == 0) ? 1 : (strncmp(cmd, F_(values), 6) == 0) ? 2 : 0;
    }

    // see if we're showing all sensors
    if (show_all) {
        for (const auto & sensor : sensors_) {
            if (show_all == 1) {
                // info
                JsonObject dataSensor = output[sensor.name()].to<JsonObject>();
                addSensorJson(dataSensor, sensor);
            } else {
                // values, shortname version. Also used in 'system allvalues'
                output[sensor.name()] = sensor.value();
            }
        }
        return true;
    }

    // this is for a specific sensor
    // make a copy of the string command for parsing, and lowercase it
    char   sensor_name[COMMAND_MAX_LENGTH] = {'\0'};
    char * attribute_s     = nullptr;
    strlcpy(sensor_name, Helpers::toLower(cmd).c_str(), sizeof(sensor_name));

    // check specific attribute to fetch instead of the complete record
    char * breakp = strchr(sensor_name, '/');
    if (breakp) {
        *breakp     = '\0';
        attribute_s = breakp + 1;
    }

    for (const auto & sensor : sensors_) {
        if (sensor_name == Helpers::toLower(sensor.name()) || Helpers::atoint(sensor_name) == sensor.gpio()) {
            // add the details
            addSensorJson(output, sensor);

